export default defineEventHandler((event) => {

    const query = getQuery(event)

    const searchText = (query.search || '').toString().toLowerCase().trim()

    const cities = [
        { "id": 3, "name": "Москва" }, { "id": 5, "name": "Санкт-Петербург" }, { "id": 22, "name": "Барнаул" }, { "id": 1251, "name": "Белгород" }, { "id": 229, "name": "Владивосток" }, { "id": 914, "name": "Владикавказ" }, { "id": 20, "name": "Волгоград" }, { "id": 630, "name": "Вологда" }, { "id": 13, "name": "Воронеж" }, { "id": 8, "name": "Екатеринбург" }, { "id": 540, "name": "Ижевск" }, { "id": 16, "name": "Иркутск" }, { "id": 21, "name": "Казань" }, { "id": 623, "name": "Калининград" }, { "id": 11, "name": "Кемерово" }, { "id": 292, "name": "Киров (Кировская область)" }, { "id": 12, "name": "Краснодар" }, { "id": 23, "name": "Красноярск" }, { "id": 26, "name": "Курган" }, { "id": 1565, "name": "Липецк" }, { "id": 25, "name": "Магнитогорск" }, { "id": 873, "name": "Махачкала" }, { "id": 24, "name": "Миасс" }, { "id": 483, "name": "Набережные Челны" }, { "id": 90, "name": "Нижневартовск" }, { "id": 7, "name": "Нижний Новгород" }, { "id": 974, "name": "Новокузнецк" }, { "id": 9, "name": "Новосибирск" }, { "id": 123, "name": "Новый Уренгой" }, { "id": 27, "name": "Ноябрьск" }, { "id": 10, "name": "Омск" }, { "id": 19, "name": "Оренбург" }, { "id": 393, "name": "Пенза" }, { "id": 14, "name": "Пермь" }, { "id": 6, "name": "Ростов-на-Дону" }, { "id": 126, "name": "Салехард (Ямало-Ненецкий АО)" }, { "id": 17, "name": "Самара" }, { "id": 18, "name": "Саратов" }, { "id": 15, "name": "Ставрополь" }, { "id": 89, "name": "Сургут" }, { "id": 775, "name": "Сыктывкар" }, { "id": 1574, "name": "Тверь" }, { "id": 1221, "name": "Томск" }, { "id": 2, "name": "Тюмень" }, { "id": 322, "name": "Ульяновск" }, { "id": 4, "name": "Уфа" }, { "id": 222, "name": "Хабаровск" }, { "id": 591, "name": "Чебоксары" }, { "id": 1, "name": "Челябинск" }, { "id": 233, "name": "Южно-Сахалинск" }, { "id": 143, "name": "Якутск" }, { "id": 1504, "name": "Ярославль" }
    ]

    if (!searchText) {
        return cities
    }

    return cities.filter(city => {
        return city.name.toLowerCase().includes(searchText)
    })
})
